#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cronMailing.aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/cronMailing]
module.cronMailing_eventbridge.aws_cloudwatch_event_rule.this: Refreshing state... [id=hourly-cron-mailing]
module.s3.aws_s3_bucket.s3_uploads: Refreshing state... [id=sdc-app-uploads]
module.parameter_store.aws_ssm_parameter.zoom-class-link: Refreshing state... [id=zoom-class-link]
module.cronMailing.aws_iam_role.lambda: Refreshing state... [id=cronMailing-lambda-role]
module.s3.aws_s3_bucket.sdc_images: Refreshing state... [id=sdc-app-public-images]
module.iam.aws_iam_policy.cloudwatch_lambda_logs: Refreshing state... [id=arn:aws:iam::090215015263:policy/cloudwatch-lambda-logs-policy]
module.cronMailing.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=cronMailing-lambda-role-20211219233022141000000001]
module.cronMailing.aws_lambda_function.this: Refreshing state... [id=cronMailing]
module.cronMailing_eventbridge.aws_cloudwatch_event_target.this: Refreshing state... [id=hourly-cron-mailing-cronMailing]
module.s3.aws_s3_bucket_object.income_proof_folder: Refreshing state... [id=income-proof/]
module.s3.aws_s3_bucket_object.criminal_check_folder: Refreshing state... [id=criminal-check/]
module.s3.aws_s3_bucket_object.other_folder: Refreshing state... [id=other/]
module.s3.aws_s3_bucket_policy.sdc_images_public_read: Refreshing state... [id=sdc-app-public-images]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ses.aws_ses_domain_dkim.sdc_dkim[0] will be created
  + resource "aws_ses_domain_dkim" "sdc_dkim" {
      + dkim_tokens = (known after apply)
      + domain      = "socialdiversity.org"
      + id          = (known after apply)
    }

  # module.ses.aws_ses_domain_identity.sdc_domain[0] will be created
  + resource "aws_ses_domain_identity" "sdc_domain" {
      + arn                = (known after apply)
      + domain             = "socialdiversity.org"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # module.ses.aws_ses_email_identity.sdc will be created
  + resource "aws_ses_email_identity" "sdc" {
      + arn   = (known after apply)
      + email = "info@socialdiversity.org"
      + id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @matthewgeng, Action: `pull_request`*